app/controllers/api/channels_controller.rb

    def index
        @channels = Channel.where(server_id: params[:server_id])
---
SELECT  "channels".* FROM "channels" WHERE "channels"."server_id" = $1 LIMIT $2  [["server_id", 20], ["LIMIT", 1]]

    def show
        @channel = Channel.find(params[:id]);
---
SELECT  "channels".* FROM "channels" WHERE "channels"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]