app/controllers/api/server_users_controller.rb

SELECT  "servers".* FROM "servers" WHERE "servers"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
INSERT INTO "server_users" ("server_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["server_id", 15], ["user_id", 19], ["created_at", "2020-06-11 21:05:29.800844"], ["updated_at", "2020-06-11 21:05:29.800844"]]
---
    def create
        @server_user = ServerUser.new
        server = Server.find_by(id: params[:server_user][:server_id])

        if server.users.ids.include?(current_user.id)
            render json: ["You're already in this server dummy!"], status: 422
        else
            if server
                @server_user.server_id = server.id
                @server_user.user_id = current_user.id
                @server_user.save