app/controllers/api/servers_controller.rb

    def index
        @servers = Server.all
---
SELECT "servers".* FROM "servers"

    def show
        @server = Server.find(params[:id])
---
SELECT  "servers".* FROM "servers" WHERE "servers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        @server = Server.new(server_params)
        @server.owner_id = current_user.id

        if @server.save
---
INSERT INTO "servers" ("private", "name", "owner_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["private", false], ["name", "lets goooo"], ["owner_id", 14], ["created_at", "2020-06-11 17:50:05.817013"], ["updated_at", "2020-06-11 17:50:05.817013"]]

    def update
        @server = Server.current_user.owned_servers.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]