app/controllers/api/users_controller.rb

    def show
        # @user = User.find(params[:id])
        @user = User.includes(:servers).find(params[:id])
---
SELECT "servers".* FROM "servers" INNER JOIN "server_users" ON "servers"."id" = "server_users"."server_id" WHERE "server_users"."user_id" = $1  [["user_id", 14]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]