app/views/api/users/_user.json.jbuilder

SELECT "servers".* FROM "servers" INNER JOIN "server_users" ON "servers"."id" = "server_users"."server_id" WHERE "server_users"."user_id" = $1  [["user_id", 14]]
---
json.extract! user, :id, :username, :email
json.serverIds user.servers.map(&:id)