app/views/api/servers/index.json.jbuilder

SELECT "users".* FROM "users" INNER JOIN "server_users" ON "users"."id" = "server_users"."user_id" WHERE "server_users"."server_id" = $1  [["server_id", 13]]
---
        json.ownerId server.owner_id
        json.userIds server.users.map(&:id)