app/views/api/servers/show.json.jbuilder

json.users do
  @server.users.each do |user|
---
SELECT "users".* FROM "users" INNER JOIN "server_users" ON "users"."id" = "server_users"."user_id" WHERE "server_users"."server_id" = $1  [["server_id", 9]]